// import { useState } from 'react'
import Header from './components/Header/Header'
import Button from './components/Button/Button'
import Line from './components/Line/Line'
import ServicePackage from './components/Service-Package/ServicePackage'
import Projects from './components/swiper-projects/Projects'
import './App.css'

import { Navigation, Pagination, A11y } from 'swiper/modules';

import { Swiper, SwiperSlide } from 'swiper/react';

// Import Swiper styles
import 'swiper/css';
import 'swiper/css/navigation';
import 'swiper/css/pagination';
import 'swiper/css/scrollbar';

function App() {

  return (
    <>
      <div className="block-1">
			<Header />
			<h1>Ремонт и <br /> отделка в Сочи</h1>
			<span>
				<svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
				<path d="M9 0L18 9L9 18L0 9L9 0Z" fill="#FFFBFC"/>
				</svg>
				<p>Отремонтируем ваш дом, квартиру или комнату</p>
			</span>
			<div className="order">
				<p>Все виды услуг по ремонту, отделке и проектированию</p>
				<Button>Заказать ремонт</Button>
			</div>
		</div>

		<div className="block-2">
			<h1>Лучшие решения по ремонту и отделке для жителей Сочи!</h1>
			<Line className='Line-1'></Line>
			<span>
				<svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
				<path d="M9 0L18 9L9 18L0 9L9 0Z" fill="#40362E"/>
				</svg>
				<p>Виды работ</p>
			</span>
			<div className="switch-buttons">
				<button className='switch-left'>
					<svg width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M8.328 11.5L13.692 6.13605L12.278 4.72205L4.5 12.5L12.278 20.278L13.692 18.864L8.328 13.5H20.5V11.5H8.328Z" fill="#848386"/>
					</svg>
				</button>
				<button className='switch-right'>
					<svg width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M16.672 11.5L11.308 6.13605L12.722 4.72205L20.5 12.5L12.722 20.278L11.308 18.864L16.672 13.5H4.5V11.5H16.672Z" fill="#848386"/>
					</svg>
				</button>
			</div>
			<div className="work">
				<div className="types-of-works">
					<img src="./images/capitalRepair.png" alt="" />
					<p>Капитальный ремонт</p>
				</div>
				<div className="types-of-works">
					<img src="./images/officeRepair.png" alt="" />
					<p>Офисный ремонт</p>
				</div>
				<div className="types-of-works">
					<img src="./images/blackRepair.png" alt="" />
					<p>Черновой ремонт</p>
				</div>
			</div>
			<Line className="Line-2" />
			<Button className='Button'>Заказать ремонт</Button>
		</div>
		
		<div className="block-3">
			<h1>Реализуем проект в вашем помещении!</h1>
			<span>
				<svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
				<path d="M9 0L18 9L9 18L0 9L9 0Z" fill="#0A0A0A"/>
				</svg>
				<p>Скидка 20% при первом заказе</p>
			</span>
			<Button className='Btn-3'>Заказать ремонт</Button>
		</div>

		<div className="block-4">
			<h1>Готовые пакеты услуг, в зависимости от количества м2</h1>
			<div className="service">
				<ServicePackage
				forWhat="Для квартир"
				price="от 14.000 ₽ за м2"
				>Бюджетная отделка и ремонт квартиры</ServicePackage>
				<ServicePackage
				forWhat="Любая недвижимость"
				price="от 16.000 ₽ за м2"
				>Уникальный дизайнерский ремонт</ServicePackage>
				<ServicePackage
				forWhat="Любая недвижимость"
				price="от 40.000 ₽ за м2"
				>Премиум, лакшери отделка и ремонт</ServicePackage>
			</div>
		</div>

		<div className="block-5">
			<h1>Почему мы предоставляем <br /> лучшие услуги в Сочи</h1>
			<span>
				<svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M9 0L18 9L9 18L0 9L9 0Z" fill="#40362E"/>
				</svg>
				<p>Преимущества</p>
			</span>
			<div className="Circles">
				<div className="circle"><p>Уникальный дизайн</p></div>
				<div className="circle brown"><p>Лучшие материалы</p></div>
				<div className="circle"><p>Быстрое выполнение</p></div>
			</div>
			<h4>Ремонтируем квартиры уже более 20 лет. Имеем более 60 сотрудников в штате, которые горят своим делом.</h4>
			<Button className='BlackBtn'>О компании</Button>
		</div>

		<div className="block-6">
			<h1>Наши проекты, выполненные за 10 лет работы</h1>
			
			<Swiper className="Swiper"
					// install Swiper modules
					modules={[Navigation, A11y]}
					spaceBetween={50}
					slidesPerView={1}
					navigation
					loop={true}
					onSwiper={(swiper) => console.log(swiper)}
					onSlideChange={() => console.log('slide change')}
				 >
					<SwiperSlide>
						<Projects
				forWhat="Квартира"
				discript="32,3 м2, Дизайнерский ремонт, отельная отделка"
				price="234.000 ₽"
				png="./images/project1.png"
			></Projects>
			<Projects
				forWhat="Квартира"
				discript="127,7 м2, Премиум ремонт, деревянная отделка"
				price="1.324.000 ₽"
				png="./images/project2.png"
			></Projects>
			</SwiperSlide>
					<SwiperSlide>
					<Projects
				forWhat="Квартира"
				discript="32,3 м2, Дизайнерский ремонт, отельная отделка"
				price="234.000 ₽"
				png="./images/project1.png"
			></Projects>
			<Projects
				forWhat="Квартира"
				discript="127,7 м2, Премиум ремонт, деревянная отделка"
				price="1.324.000 ₽"
				png="./images/project2.png"
			></Projects>
					</SwiperSlide>
					<SwiperSlide>
					<Projects
				forWhat="Квартира"
				discript="32,3 м2, Дизайнерский ремонт, отельная отделка"
				price="234.000 ₽"
				png="./images/project1.png"
			></Projects>
			<Projects
				forWhat="Квартира"
				discript="127,7 м2, Премиум ремонт, деревянная отделка"
				price="1.324.000 ₽"
				png="./images/project2.png"
			></Projects>
					</SwiperSlide>
					<SwiperSlide>
					<Projects
				forWhat="Квартира"
				discript="32,3 м2, Дизайнерский ремонт, отельная отделка"
				price="234.000 ₽"
				png="images/project1.png"
			></Projects>
			<Projects
				forWhat="Квартира"
				discript="127,7 м2, Премиум ремонт, деревянная отделка"
				price="1.324.000 ₽"
				png="images/project2.png"
			></Projects>
					</SwiperSlide>
			</Swiper>
			<Button>Все проекты</Button>
		</div>

		<div className="block-7">
			<h1>Захочется приглашать гостей каждый день</h1>
			<span>
				<svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M9 0L18 9L9 18L0 9L9 0Z" fill="#FFFBFC"/>
				</svg>
				<p>Скидка 20% при первом заказе</p>
			</span>
			<button className='btnUp'>
				<svg width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
				<path d="M11.5002 8.328L6.13617 13.692L4.72217 12.278L12.5002 4.5L20.2782 12.278L18.8642 13.692L13.5002 8.328L13.5002 20.5L11.5002 20.5L11.5002 8.328Z" fill="#848386"/>
				</svg>
			</button>
			<Button>Заказать ремонт</Button>
		</div>

		<div className="block-8">
			<h1>Сочи Ремонт - Ваш эксперт в мире ремонта</h1>
			<div className="sochiRepair">
				<p>Сочи Ремонт - Профессиональный ремонт квартир в Сочи</p>
				<p>Сочи Ремонт предлагает комплексные решения для ремонта и отделки квартир в Сочи. Капитальный ремонт, дорогие интерьеры, работа под ключ. Узнайте о наших ценах и качестве услуг.</p>
				<p>Ремонт квартир в Сочи, капитальный ремонт сочи, дорогой ремонт сочи, ремонт под ключ сочи, отделка квартир в сочи</p>
			</div>
			<div className="about">
				<h2>О компании</h2>
				<p>Компания "Сочи Ремонт" с гордостью представляет широкий спектр ремонтных и отделочных услуг в Сочи с 2015 года. Наша миссия — превращать ваше жилище в место мечты с помощью инновационных решений и безупречного качества работы. <br />
				<br />
				Мы специализируемся на ремонте квартир в Сочи, предлагая услуги от косметического до капитального ремонта. Благодаря глубоким знаниям местного рынка и опыту, наша команда гарантирует выполнение проектов любой сложности на высшем уровне.</p>
			</div>
			<div className="reviews">
				<h2>Отзывы клиентов</h2>
				<p>Мы ценим каждого нашего клиента и стремимся к тому, чтобы каждый проект был выполнен идеально. В разделе <b>отзывы о ремонте в Сочи</b>, вы можете узнать мнения людей, которые уже воспользовались нашими услугами. Их положительные отклики — лучшее подтверждение нашего качества и профессионализма.</p>
			</div>
			<div className="our-services">
				<h2>Наши услуги</h2>
				<div className='flex-box'>
					<p>Мы предлагаем широкий спектр услуг, включая:</p>
					<div className="span-gap">
						<span>
							<svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M9 0L18 9L9 18L0 9L9 0Z" fill="#000"/>
							</svg>
							<p><b>Капитальный ремонт квартир в Сочи:</b> Полное преобразование вашего пространства с заменой всех инженерных систем и конструкционных элементов.</p>
						</span>
						<span>
						<svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M9 0L18 9L9 18L0 9L9 0Z" fill="#000"/>
							</svg>
							<p><b>Дорогой ремонт в Сочи:</b> Эксклюзивные дизайнерские решения и использование премиум материалов для создания уникальных интерьеров.</p>
						</span>
						<span>
						<svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M9 0L18 9L9 18L0 9L9 0Z" fill="#000"/>
							</svg>
							<p><b>Ремонт квартир в Сочи под ключ:</b>От начального проекта до последних штрихов — полный спектр работ под одним крылом "Сочи Ремонт".</p>
						</span>
						<span>
						<svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M9 0L18 9L9 18L0 9L9 0Z" fill="#000"/>
							</svg>
							<p><b>Отделка квартир в Сочи:</b> Выполнение всех видов отделочных работ, включая малярные, плиточные и другие виды работ.</p>
						</span>
						<span>
						<svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M9 0L18 9L9 18L0 9L9 0Z" fill="#000"/>
							</svg>
							<p><b>Ремонт квартир в новостройке Сочи:</b> Адаптация и улучшение квартир в новых жилых комплексах по индивидуальным проектам.</p>
						</span>
					</div>
					<p>Каждая услуга реализуется с учетом индивидуальных пожеланий клиентов и с применением самых современных и качественных материалов.</p>
				</div>
			</div>
			<div className="repair-prices">
				<h2>Цены на ремонт в Сочи</h2>
				<p>В "Сочи Ремонт" вы найдете прозрачную и честную ценовую политику. Мы предлагаем <strong>ремонт квартир в Сочи по адекватным ценам</strong>, оптимизированным под каждый конкретный проект. Наши предложения позволяют вам выбрать оптимальный вариант ремонта в зависимости от ваших нужд и бюджета <br />
				<br />
				Для более детальной информации о ценах, пожалуйста, посетите нашу страницу "Цены" или свяжитесь с нами для получения персонализированной сметы.</p>
			</div>
			<div className="contacts">
				<h2>Контакты</h2>
				<p>Если у вас возникли вопросы или вы хотите обсудить ваш проект ремонта, наша команда всегда к вашим услугам. Мы доступны для консультаций и готовы начать работу над вашим проектом в удобное для вас время.</p>
			</div>
		</div>

		<footer>
		<svg className='Logo' width="126" height="100" viewBox="0 0 126 100" fill="none" xmlns="http://www.w3.org/2000/svg">
		<path fill-rule="evenodd" clip-rule="evenodd" d="M0 36.6757V100L4.69743 100V39.8408L122.132 5.78141V20.2011L19.7918 49.4672V100L125.474 100V50V0L0 36.6757ZM54.3812 59.2592L122.042 41.0117V48.9611L54.3812 67.1183V59.2592Z" fill="#40362E"/>
		</svg>
		<p className='pol'>Политика конфиденциальности</p>
		<p className='date'>©️ 2017 - 2023 Сочи-Ремонт. <br /> Все права защищены. </p>
		<p className='creator'>Разработано <span>Студией Сайтов</span></p>
		<div className="links1" id='links1'>
			<a href="#links1">Все услуги</a>
			<a href="#links1">Капитальный ремонт</a>
			<a href="#links1">Офисный ремонт</a>
			<a href="#links1">Черновой ремонт</a>
			<a href="#links1">Евроремонт</a>
		</div>
		<div className="links2" id='links2'>
			<a href="#links2">Акции</a>
			<a href="#links2">О нас</a>
			<a href="#links2">Отзывы</a>
			<a href="#links2">Вопрос-ответ</a>
			<a href="#links2">Блог</a>
			<a href="#links2">Контакты</a>
			<a href="#links2">Карта сайта</a>
		</div>
		<div className="email">
			<h5>E-mail</h5>
			<p>sochi-repair@gmail.com</p>
		</div>
		<div className="phone">
			<h5>Номер телефона</h5>
			<p>+7 (931) 724 09 42</p>
		</div>
		<div className="icons">
		<svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
		<rect x="0.5" y="0.5" width="47" height="47" rx="23.5" stroke="#848386"/>
		<path d="M24.8574 30C18.2975 30 14.5558 25.4955 14.3999 18H17.6858C17.7938 23.5015 20.2163 25.8318 22.1351 26.3123V18H25.2291V22.7447C27.124 22.5405 29.1147 20.3784 29.7863 18H32.8804C32.6273 19.2335 32.1228 20.4014 31.3985 21.4307C30.6742 22.46 29.7457 23.3285 28.671 23.982C29.8706 24.579 30.9302 25.4241 31.7798 26.4615C32.6295 27.4988 33.2498 28.7049 33.5999 30H30.194C29.8797 28.8751 29.241 27.8681 28.3578 27.1053C27.4746 26.3424 26.3862 25.8577 25.2291 25.7117V30H24.8574Z" fill="#848386"/>
		</svg>
		<svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
		<rect x="0.5" y="0.5" width="47" height="47" rx="23.5" stroke="#848386"/>
		<path d="M31.2002 17.3524L28.353 31.7504C28.353 31.7504 27.9546 32.7486 26.8602 32.2699L20.2908 27.2175L20.2604 27.2026C21.1478 26.4033 28.0288 20.1975 28.3295 19.9162C28.7951 19.4806 28.5061 19.2212 27.9655 19.5503L17.8014 26.0249L13.8801 24.7014C13.8801 24.7014 13.263 24.4813 13.2036 24.0025C13.1435 23.523 13.9004 23.2636 13.9004 23.2636L29.8863 16.9732C29.8863 16.9732 31.2002 16.3941 31.2002 17.3524Z" fill="#848386"/>
		</svg>
		<svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
		<rect x="0.5" y="0.5" width="47" height="47" rx="23.5" stroke="#848386"/>
		<path d="M30.7901 17.2004C28.9839 15.4004 26.5755 14.4004 24.0333 14.4004C18.7483 14.4004 14.4668 18.6671 14.4668 23.9337C14.4668 25.6004 14.9351 27.2671 15.7379 28.6671L14.3999 33.6004L19.4842 32.2671C20.8891 33.0004 22.4278 33.4004 24.0333 33.4004C29.3184 33.4004 33.5999 29.1337 33.5999 23.8671C33.533 21.4004 32.5964 19.0004 30.7901 17.2004ZM28.6494 27.3337C28.4487 27.8671 27.5121 28.4004 27.0438 28.4671C26.6424 28.5337 26.1072 28.5337 25.572 28.4004C25.2375 28.2671 24.7692 28.1337 24.234 27.8671C21.8257 26.8671 20.287 24.4671 20.1532 24.2671C20.0194 24.1337 19.1497 23.0004 19.1497 21.8004C19.1497 20.6004 19.7518 20.0671 19.9525 19.8004C20.1532 19.5337 20.4208 19.5337 20.6215 19.5337C20.7553 19.5337 20.956 19.5337 21.0898 19.5337C21.2236 19.5337 21.4243 19.4671 21.625 19.9337C21.8257 20.4004 22.294 21.6004 22.3609 21.6671C22.4278 21.8004 22.4278 21.9337 22.3609 22.0671C22.294 22.2004 22.2271 22.3337 22.0933 22.4671C21.9595 22.6004 21.8257 22.8004 21.7588 22.8671C21.625 23.0004 21.4912 23.1337 21.625 23.3337C21.7588 23.6004 22.2271 24.3337 22.963 25.0004C23.8996 25.8004 24.6354 26.0671 24.903 26.2004C25.1706 26.3337 25.3044 26.2671 25.4382 26.1337C25.572 26.0004 26.0403 25.4671 26.1741 25.2004C26.3079 24.9337 26.5086 25.0004 26.7093 25.0671C26.91 25.1337 28.1142 25.7337 28.3149 25.8671C28.5825 26.0004 28.7163 26.0671 28.7832 26.1337C28.8501 26.3337 28.8501 26.8004 28.6494 27.3337Z" fill="#848386"/>
		</svg>
		<svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
		<rect x="0.5" y="0.5" width="47" height="47" rx="23.5" stroke="#848386"/>
		<path fill-rule="evenodd" clip-rule="evenodd" d="M16.3744 30.7744C16.0321 30.6629 15.7197 30.4647 15.4637 30.1965C15.2077 29.9282 15.0155 29.5977 14.9034 29.233C14.2628 27.3477 14.073 19.4753 15.3068 17.9212C15.7174 17.4156 16.2971 17.1043 16.9201 17.0549C20.2299 16.6728 30.4559 16.7237 31.6303 17.1823C31.9606 17.2974 32.2624 17.4913 32.5131 17.7494C32.7637 18.0075 32.9567 18.3231 33.0776 18.6727C33.7775 20.6217 33.8013 27.7044 32.9827 29.5769C32.7656 30.0644 32.4021 30.4592 31.9506 30.6979C30.7169 31.3603 18.0115 31.3476 16.3744 30.7744ZM21.6298 27.0802L27.5613 23.7681L21.6298 20.4306V27.0802Z" fill="#848386"/>
		</svg>
		<svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
		<rect x="0.5" y="0.5" width="47" height="47" rx="23.5" stroke="#848386"/>
		<path d="M29.6095 25.754C30.0697 25.2765 30.1354 24.5942 29.741 23.9119C29.4123 23.3661 28.8206 23.0932 28.1632 23.2296C27.9002 23.2979 27.6373 23.4343 27.3743 23.639C25.3363 25.0718 22.5752 25.0035 20.5372 23.5708C20.4057 23.5025 20.2742 23.4343 20.1428 23.3661C19.4196 23.0249 18.6965 23.1614 18.302 23.8437C17.8418 24.526 17.9075 25.2765 18.4992 25.8905C18.6307 26.027 18.7622 26.0952 18.8279 26.2316L18.8937 26.2999C19.8141 27.0504 20.9317 27.528 22.378 27.7326L21.5233 28.6196C20.8002 29.3701 20.0113 30.1888 19.2881 30.9393C19.0909 31.144 18.8279 31.4851 18.8279 31.9627C18.8279 32.5768 19.1566 33.1908 19.7483 33.4637C19.9455 33.6002 20.1428 33.6002 20.34 33.6002C20.6687 33.6002 21.0631 33.4637 21.3261 33.1226C22.3122 32.0992 23.1011 31.2805 23.89 30.4617C23.9558 30.3935 23.9558 30.3935 23.9558 30.3935C23.9558 30.3935 24.0215 30.3935 24.0215 30.4617C24.5474 31.0758 25.1391 31.6216 25.665 32.2356C25.928 32.5086 26.191 32.7815 26.4539 33.0544C26.7826 33.3955 27.0456 33.532 27.44 33.532C28.0317 33.6002 28.6891 33.1908 28.9521 32.5768C29.2151 32.031 29.0836 31.3487 28.6234 30.9393C27.966 30.2571 27.3086 29.5065 26.5854 28.8243L25.4678 27.6644C26.0595 27.5962 26.7169 27.4597 27.3086 27.1868C28.2947 26.8457 29.0178 26.3681 29.6095 25.754Z" fill="#848386"/>
		<path d="M23.9558 23.8437C26.7826 23.8437 29.0836 21.5239 29.0836 18.5902C29.0836 17.1574 28.5576 15.7928 27.5715 14.7694C26.5854 13.746 25.3363 13.2002 24.0215 13.2002C21.1946 13.2002 18.9594 15.5882 18.8937 18.4537C18.8937 19.8865 19.4196 21.1828 20.4057 22.2062C21.3261 23.2978 22.5752 23.8437 23.9558 23.8437ZM22.5094 17.0209C22.9039 16.6116 23.4298 16.4069 23.9558 16.4069C25.1391 16.4069 25.9937 17.3621 25.9937 18.5219C25.9937 19.75 25.0734 20.637 23.9558 20.637C22.7724 20.637 21.9178 19.6818 21.9178 18.5219C21.9178 17.9761 22.115 17.4303 22.5094 17.0209Z" fill="#848386"/>
		<path d="M29.6095 25.754C30.0697 25.2765 30.1354 24.5942 29.741 23.9119C29.4123 23.3661 28.8206 23.0932 28.1632 23.2296C27.9002 23.2979 27.6373 23.4343 27.3743 23.639C25.3363 25.0718 22.5752 25.0035 20.5372 23.5708C20.4057 23.5025 20.2742 23.4343 20.1428 23.3661C19.4196 23.0249 18.6965 23.1614 18.302 23.8437C17.8418 24.526 17.9075 25.2765 18.4992 25.8905C18.6307 26.027 18.7622 26.0952 18.8279 26.2316L18.8937 26.2999C19.8141 27.0504 20.9317 27.528 22.378 27.7326L21.5233 28.6196C20.8002 29.3701 20.0113 30.1888 19.2881 30.9393C19.0909 31.144 18.8279 31.4851 18.8279 31.9627C18.8279 32.5768 19.1566 33.1908 19.7483 33.4637C19.9455 33.6002 20.1428 33.6002 20.34 33.6002C20.6687 33.6002 21.0631 33.4637 21.3261 33.1226C22.3122 32.0992 23.1011 31.2805 23.89 30.4617C23.9558 30.3935 23.9558 30.3935 23.9558 30.3935C23.9558 30.3935 24.0215 30.3935 24.0215 30.4617C24.5474 31.0758 25.1391 31.6216 25.665 32.2356C25.928 32.5086 26.191 32.7815 26.4539 33.0544C26.7826 33.3955 27.0456 33.532 27.44 33.532C28.0317 33.6002 28.6891 33.1908 28.9521 32.5768C29.2151 32.031 29.0836 31.3487 28.6234 30.9393C27.966 30.2571 27.3086 29.5065 26.5854 28.8243L25.4678 27.6644C26.0595 27.5962 26.7169 27.4597 27.3086 27.1868C28.2947 26.8457 29.0178 26.3681 29.6095 25.754Z" fill="#848386"/>
		</svg>
		</div>
		<Button>Обратный звонок</Button>
		</footer>
    </>
  )
}

export default App
